package homework01;

public class homework10 {
//	• 請設計一隻程式,用亂數產生5個介於1~100之間的整數,而輸出結果可以判斷出這5個整數為是否
//	為質數 (提示:Math類別)
//
//	• 請設計一隻程式,讓使用者可以輸入一個任意數後,可以選擇要以下列何種表示方法顯示(1)千分位
//	(2)百分比(3)科學記號,而輸入非任意數會顯示提示訊息如圖 (提示: TestFormatter.java, Java API
//	文件, 判斷數字可用正規表示法)
//	• 補充 (依此類推):
//	輸入12345,千分位為12,345,輸入123,千分位為123
//	輸入0.75,百分比為75%,輸入1,結果為100%
//
//	• 請設計一隻程式,讓使用者輸入日期(年月日,例如:20110131)後,可以轉成想要的輸出格式化成(1)
//	年/月/日(2)月/日/年(3)日/月/年三選一,而輸入非指定日期數字格式會顯示出提示訊息如圖
//	(提示:TestFormatter.java, Java API文件,判斷格式可用正規表示法)

}
